import Dialog from './Dialog'

const dnsDialog = Dialog.fromJson({
  character: 'מפעיל שרת הכתובות',
  rootSegment: {
    text: 'שלום! אני מפעיל שרת הכתובות. אני יודע את כל הכתובות באינטרנט! איך אני יכול לעזור לכם?',
    choices: {
      'מה אתה עושה פה?': {
        text: 'אני יושב פה ונותן כתובות למחשבים ברחבי העולם! כל מי שרוצה כתובת צריך לעבור פה ולשאול אותי מה היא. יש איזה כתובת שאתם צריכים?',
        choices: {
          'אנחנו רוצים את הכתובת של המחשב של דוקטור ויר': {
            text: 'הכתובת היא 13א. תרצו כתובת נוספת?',
            choices: {
              'אנחנו רוצים את הכתובת של השרת של עידן': {
                text: 'הכתובת היא 25ב. תרצו כתובת נוספת?',
                choices: {
                  'אנחנו רוצים דברים כיפיים לעשות באינטרנט': 'הכתובת היא 7ג',
                }
              },
              'אנחנו רוצים דברים כיפיים לעשות באינטרנט': {
                text: 'הכתובת היא 7ג. תרצו כתובת נוספת?',
                choices: {
                  'אנחנו רוצים את הכתובת של השרת של עידן': 'הכתובת היא 25ב'
                }
              }
            }
          },
          'אנחנו רוצים את הכתובת של השרת של עידן': {
            text: 'הכתובת היא 25ב. תרצו כתובת נוספת?',
            choices: {
              'אנחנו רוצים את הכתובת של המחשב של דוקטור ויר': {
                text: 'הכתובת היא 13א. תרצו כתובת נוספת?',
                choices: {
                  'אנחנו רוצים דברים כיפיים לעשות באינטרנט': 'הכתובת היא 7ג',
                }
              },
              'אנחנו רוצים דברים כיפיים לעשות באינטרנט': {
                text: 'הכתובת היא 7ג. תרצו כתובת נוספת?',
                choices: {
                  'אנחנו רוצים את הכתובת של המחשב של דוקטור ויר': 'הכתובת היא 13א',
                }
              }
            }
          },
          'אנחנו רוצים דברים כיפיים לעשות באינטרנט': {
            text: 'הכתובת היא 7ג. תרצו כתובת נוספת?',
            choices: {
              'אנחנו רוצים את הכתובת של המחשב של דוקטור ויר': {
                text: 'הכתובת היא 13א. תרצו כתובת נוספת?',
                choices: {
                  'אנחנו רוצים את הכתובת של השרת של עידן': 'הכתובת היא 25ב',
                }
              },
              'אנחנו רוצים את הכתובת של השרת של עידן': {
                text: 'הכתובת היא 25ב. תרצו כתובת נוספת?',
                choices: {
                  'אנחנו רוצים את הכתובת של המחשב של דוקטור ויר': 'הכתובת היא 13א',
                }
              }
            }
          }
        }
      }
    }
  }
})

export default dnsDialog
